<a href="https://colab.research.google.com/github/lydiamokaya/SQL/blob/master/SQL_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

CONNECTING TO OUR DATABASE

In [ ]:
# We will first load the sql extension into our environment
%load_ext sql

# Then connect to our in memory sqlite database
# NB: This database will cease to exist as soon as the database connection is closed. 
%sql sqlite://

'Connected: @None'

LOADING DATA FROM OUR CSV FILES

In [ ]:
# Importing Pandas
import pandas as pd

In [ ]:
# Loading our GrandElectors dataset
# 
#OUR CODE GOES HERE
with open('GrandElectors_by_state.csv','r') as f:
    GrandElectors = pd.read_csv(f, index_col=0, encoding='utf-8')

%sql DROP TABLE if EXISTS GrandElectors;
%sql PERSIST  GrandElectors;
%sql SELECT * FROM GrandElectors LIMIT 5;

 * sqlite://
Done.
 * sqlite://
 * sqlite://
Done.

[('Alabama', 9),
 ('Alaska', 3),
 ('Arizona', 11),
 ('Arkansas', 6),
 ('California', 55)]

In [ ]:
# Loading our population dataset 
# 
#OUR CODE GOES HERE
with open('Population_by_state.csv','r') as f:
    population = pd.read_csv(f, index_col=0, encoding='utf-8')

%sql DROP TABLE if EXISTS population;
%sql PERSIST population;
%sql SELECT * FROM population LIMIT 5;

 * sqlite://
Done.
 * sqlite://
 * sqlite://
Done.

[('CALIFORNIA', 39144818),
 ('TEXAS', 27469114),
 ('FLORIDA', 20271272),
 ('NEW YORK', 19795791),
 ('ILLINOIS', 12859995)]

In [ ]:
#CHALLENGE 1
#converting the states column to all uppercase.
%%sql

UPDATE GrandElectors SET State = UPPER(State);

SELECT * FROM GrandElectors 
LIMIT 10;

 * sqlite://
51 rows affected.
Done.

[('ALABAMA', 9),
 ('ALASKA', 3),
 ('ARIZONA', 11),
 ('ARKANSAS', 6),
 ('CALIFORNIA', 55),
 ('COLORADO', 9),
 ('CONNECTICUT', 7),
 ('DISTRICT OF COLUMBIA', 3),
 ('DELAWARE', 3),
 ('FLORIDA', 29)]

In [ ]:
#joining the 2 tables
%%sql
SELECT GrandElectors.state, GrandElectors.GrandElectors, population.Population FROM GrandElectors
INNER JOIN population
ON GrandElectors.state = population.state

 * sqlite://
Done.

[('ALABAMA', 9, 4858979),
 ('ALASKA', 3, 738432),
 ('ARIZONA', 11, 6828065),
 ('ARKANSAS', 6, 2978204),
 ('CALIFORNIA', 55, 39144818),
 ('COLORADO', 9, 5456574),
 ('CONNECTICUT', 7, 3590886),
 ('DISTRICT OF COLUMBIA', 3, 672228),
 ('DELAWARE', 3, 945934),
 ('FLORIDA', 29, 20271272),
 ('GEORGIA', 16, 10214860),
 ('HAWAII', 4, 1431603),
 ('IDAHO', 4, 1654930),
 ('ILLINOIS', 20, 12859995),
 ('INDIANA', 11, 6619680),
 ('IOWA', 6, 3123899),
 ('KANSAS', 6, 2911641),
 ('KENTUCKY', 8, 4425092),
 ('LOUISIANA', 8, 4670724),
 ('MAINE', 4, 1329328),
 ('MARYLAND', 10, 6006401),
 ('MASSACHUSETTS', 11, 6794422),
 ('MICHIGAN', 16, 9922576),
 ('MINNESOTA', 10, 5489594),
 ('MISSISSIPPI', 6, 2992333),
 ('MISSOURI', 10, 6083672),
 ('MONTANA', 3, 1032949),
 ('NEBRASKA', 5, 1896190),
 ('NEVADA', 6, 2890845),
 ('NEW HAMPSHIRE', 4, 1330608),
 ('NEW JERSEY', 14, 8958013),
 ('NEW MEXICO', 5, 2085109),
 ('NEW YORK', 29, 19795791),
 ('NORTH CAROLINA', 15, 10042802),
 ('NORTH DAKOTA', 3, 756927),
 ('OHIO', 18, 11613423),
 ('OKLAHOMA', 7, 3911338),
 ('OREGON', 7, 4028977),
 ('PENNSYLVANIA', 20, 12802503),
 ('RHODE ISLAND', 4, 1056298),
 ('SOUTH CAROLINA', 9, 4896146),
 ('SOUTH DAKOTA', 3, 858469),
 ('TENNESSEE', 11, 6600299),
 ('TEXAS', 38, 27469114),
 ('UTAH', 6, 2995919),
 ('VERMONT', 3, 626042),
 ('VIRGINIA', 13, 8382993),
 ('WASHINGTON', 12, 7170351),
 ('WEST VIRGINIA', 5, 1844128),
 ('WISCONSIN', 10, 5771337),
 ('WYOMING', 3, 586107)]

In [ ]:
#creating and naming the new table
%%sql
CREATE TABLE US_Elections AS
SELECT GrandElectors.State, population.population, GrandElectors.GrandElectors
FROM GrandElectors 
INNER JOIN population ON GrandElectors.State = population.state;

 * sqlite://
Done.

[]

In [ ]:
#printing out the new table
%%sql
SELECT* from US_Elections
LIMIT 10;

 * sqlite://
Done.

[('ALABAMA', 4858979, 9),
 ('ALASKA', 738432, 3),
 ('ARIZONA', 6828065, 11),
 ('ARKANSAS', 2978204, 6),
 ('CALIFORNIA', 39144818, 55),
 ('COLORADO', 5456574, 9),
 ('CONNECTICUT', 3590886, 7),
 ('DISTRICT OF COLUMBIA', 672228, 3),
 ('DELAWARE', 945934, 3),
 ('FLORIDA', 20271272, 29)]

In [ ]:
#CHALLENGE 2
#change the name of the "District of Columbia" state to its short version "DC"
%%sql
UPDATE US_Elections
SET State = "DC"
WHERE State = "DISTRICT OF COLUMBIA";

 * sqlite://
1 rows affected.

[]

In [ ]:
%%sql
SELECT * from US_Elections
LIMIT 10;

 * sqlite://
Done.

[('ALABAMA', 4858979, 9),
 ('ALASKA', 738432, 3),
 ('ARIZONA', 6828065, 11),
 ('ARKANSAS', 2978204, 6),
 ('CALIFORNIA', 39144818, 55),
 ('COLORADO', 5456574, 9),
 ('CONNECTICUT', 3590886, 7),
 ('DC', 672228, 3),
 ('DELAWARE', 945934, 3),
 ('FLORIDA', 20271272, 29)]

In [ ]:
#CHALLENGE 3
#compute the ratio between the number of grand electors and the population.
%%sql
ALTER TABLE US_Elections ADD grandelectors_per_capita;
UPDATE US_Elections
SET grandelectors_per_capita = (Population/GrandElectors);

 * sqlite://
Done.
51 rows affected.

[]

In [ ]:
#output
%%sql
SELECT * from US_Elections
LIMIT 10;

 * sqlite://
Done.

[('ALABAMA', 4858979, 9, 539886),
 ('ALASKA', 738432, 3, 246144),
 ('ARIZONA', 6828065, 11, 620733),
 ('ARKANSAS', 2978204, 6, 496367),
 ('CALIFORNIA', 39144818, 55, 711723),
 ('COLORADO', 5456574, 9, 606286),
 ('CONNECTICUT', 3590886, 7, 512983),
 ('DC', 672228, 3, 224076),
 ('DELAWARE', 945934, 3, 315311),
 ('FLORIDA', 20271272, 29, 699009)]

In [ ]:
#CHALLENGE 4
#order the states by decreasing ratio of Grand Electors per capita. 
%%sql
SELECT * FROM US_Elections
ORDER BY grandelectors_per_capita DESC
Limit 10;

 * sqlite://
Done.

[('TEXAS', 27469114, 38, 722871),
 ('CALIFORNIA', 39144818, 55, 711723),
 ('FLORIDA', 20271272, 29, 699009),
 ('NEW YORK', 19795791, 29, 682613),
 ('NORTH CAROLINA', 10042802, 15, 669520),
 ('OHIO', 11613423, 18, 645190),
 ('VIRGINIA', 8382993, 13, 644845),
 ('ILLINOIS', 12859995, 20, 642999),
 ('PENNSYLVANIA', 12802503, 20, 640125),
 ('NEW JERSEY', 8958013, 14, 639858)]

In [ ]:
#CHALLENGE 5
# compute the running total of Grand Electors in that sorted list
%%sql
CREATE TABLE sorted_list AS 
SELECT * from US_Elections;
SELECT SUM(GrandElectors) from sorted_list;

 * sqlite://
Done.
Done.

[(538,)]

In [ ]:
#CHALLENGE 6
#compute the half of the total of Grand Electors overall 
%%sql
SELECT (SUM(GrandElectors)/2) from sorted_list;

 * sqlite://
Done.

[(269,)]

In [ ]:
#CHALLENGE 7
#filter our sorted list of states in order to keep only the (top) ones enabling us to reach the computed threshold
%%sql
select * from ( select a.State, a.GrandElectors, sum(b.GrandElectors)
as runningTotal from sorted_list a 
inner join sorted_list b on a.State >= b.State 
group by a.State, a.GrandElectors) where runningTotal >= 269;

 * sqlite://
Done.

[('MINNESOTA', 10, 269),
 ('MISSISSIPPI', 6, 275),
 ('MISSOURI', 10, 285),
 ('MONTANA', 3, 288),
 ('NEBRASKA', 5, 293),
 ('NEVADA', 6, 299),
 ('NEW HAMPSHIRE', 4, 303),
 ('NEW JERSEY', 14, 317),
 ('NEW MEXICO', 5, 322),
 ('NEW YORK', 29, 351),
 ('NORTH CAROLINA', 15, 366),
 ('NORTH DAKOTA', 3, 369),
 ('OHIO', 18, 387),
 ('OKLAHOMA', 7, 394),
 ('OREGON', 7, 401),
 ('PENNSYLVANIA', 20, 421),
 ('RHODE ISLAND', 4, 425),
 ('SOUTH CAROLINA', 9, 434),
 ('SOUTH DAKOTA', 3, 437),
 ('TENNESSEE', 11, 448),
 ('TEXAS', 38, 486),
 ('UTAH', 6, 492),
 ('VERMONT', 3, 495),
 ('VIRGINIA', 13, 508),
 ('WASHINGTON', 12, 520),
 ('WEST VIRGINIA', 5, 525),
 ('WISCONSIN', 10, 535),
 ('WYOMING', 3, 538)]

CONCLUSION.

From our study case we can conclude that our client will win if he deploy resources in the states with the running total of over 269, the result is in line with our expectations because if he prioritizes the above states he will increase the return on investment of the campaign. The states are a large number and i would recommend my client to go for it.